[M_Aster_PlotMission04 MissionDefinition]
MissionDescription="With the entrance to the mines open, nothing stands between you and the Sorcerer's tower, where the kidnapped queen awaits her rescue."
MissionSummary="Head to the Handsome Sorcerer's tower."

[M_Aster_PlotMission04:Defeatdragonset MissionObjectiveSetDefinition]
MissionSummaryOverride="Defeat the Sorcerer's dragon."
MissionDescriptionOverride="With the entrance to the mines open, nothing stands between you and the Sorcerer's tower, where the kidnapped queen awaits her rescue.<br><br>Seeing your approach, the Handsome Sorcerer has unleashed his pet dragon. You must defeat the dragon to gain entrance to the tower."

[M_Aster_PlotMission04:DefeatSorcerDaughter MissionObjectiveDefinition]
ProgressMessage="Defeat Sorcerer's Daughter"

[M_Aster_PlotMission04:DefeatSorcererDaughterSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Defeat the Sorcerer's Daughter."
MissionDescriptionOverride="You're (sorta) trapped in the Handsome Sorcerer's dungeon -- if you can't escape and reach the Sorcerer's keep, you'll never rescue the queen!<br><br>You tracked down a mysterious prisoner in the hopes that she might be able to help you escape. In reality, however, the prisoner -- who turned out to be the Handsome Sorcerer's tortured daughter -- is actually evil as heck and wants you dead. <br><br>You'd better kill her and escape the dungeon."

[M_Aster_PlotMission04:EnterSorcerersCastleSet2 MissionObjectiveSetDefinition]
MissionDescriptionOverride="With the entrance to the mines open, nothing stands between you and the Sorcerer's keep, where the kidnapped queen awaits her rescue."

[M_Aster_PlotMission04:EscapeTheDungeon MissionObjectiveDefinition]
ProgressMessage="Escape from dungeon"

[M_Aster_PlotMission04:ExitMines MissionObjectiveDefinition]
ProgressMessage="Exit the dwarven mines"

[M_Aster_PlotMission04:FeedButtstallionSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've rescued Queen Butt Stallion, but she needs some food in order to cast her magic spell and bring light back to the world. You'd better feed her."

[M_Aster_PlotMission04:FindThePrisonerSet1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="You're (sorta) trapped in the Handsome Sorcerer's dungeon -- if you can't escape and reach the Sorcerer's keep, you'll never rescue the queen!<br><br>Thankfully, you've heard the voice of a mysterious prisoner somewhere in the dungeon. If you can find her, maybe she'll know how to escape!"

[M_Aster_PlotMission04:FreeTheQueenSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Rescue the queen."
MissionDescriptionOverride="You must rescue the queen before the late Sorcerer's knights execute her! Hurry! "

[M_Aster_PlotMission04:UseTeleporterSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The Handsome Sorcerer awaits in his castle keep. You've gotta find him, kill him, and rescue the queen!"
